Autodesk.Revit.RevitCloudConfigADPInfo.OutputAdp(System.String,System.String)
Detail download information
Uri of Revit cloud configuration to download
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.RevitCloudConfigADPInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.RevitCloudConfigADPInfo
ADP output helper class.
We use this to describe what we want to output to adp